; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l23_p23_c23_g23)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-person person1 refugio2)
	(at-person person2 refugio14)
	(at-person person3 refugio6)
	(at-person person4 refugio4)
	(at-person person5 refugio5)
	(at-person person6 refugio11)
	(at-person person7 refugio1)
	(at-person person8 refugio4)
	(at-person person9 refugio8)
	(at-person person10 refugio23)
	(at-person person11 refugio22)
	(at-person person12 refugio11)
	(at-person person13 refugio22)
	(at-person person14 refugio15)
	(at-person person15 refugio4)
	(at-person person16 refugio15)
	(at-person person17 refugio17)
	(at-person person18 refugio12)
	(at-person person19 refugio22)
	(at-person person20 refugio10)
	(at-person person21 refugio14)
	(at-person person22 refugio4)
	(at-person person23 refugio12)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person3 comida)
	(person-has person3 medicina)
	(person-has person5 medicina)
	(person-has person7 comida)
	(person-has person8 comida)
	(person-has person8 medicina)
	(person-has person9 comida)
	(person-has person11 comida)
	(person-has person13 medicina)
	(person-has person15 medicina)
	(person-has person16 comida)
	(person-has person17 comida)
	(person-has person18 comida)
	(person-has person18 medicina)
	(person-has person19 medicina)
	(person-has person20 comida)
	(person-has person20 medicina)
	(person-has person22 comida)
	(person-has person22 medicina)
	(person-has person23 medicina)
))
)

; plan
1. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 0 of 23
2. (pick box23 deposito dron1-izq dron1)
   deleted: (at-box box23 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box23)
   goals met: 0 of 23
3. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 0 of 23
4. (leave box12 refugio2 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 comida)
   added: (at-box box12 refugio2) (free dron1-der) (person-has person1 comida)
   goals met: 1 of 23
5. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 1 of 23
6. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 1 of 23
7. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 1 of 23
8. (move refugio14 refugio5 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio5)
   goals met: 1 of 23
9. (leave box23 refugio5 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box23) (box-has box23 medicina)
   added: (at-box box23 refugio5) (free dron1-izq) (person-has person5 medicina)
   goals met: 2 of 23
10. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 2 of 23
11. (pick box22 deposito dron1-izq dron1)
   deleted: (at-box box22 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box22)
   goals met: 2 of 23
12. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 2 of 23
13. (move refugio14 refugio1 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio1)
   goals met: 2 of 23
14. (leave box11 refugio1 dron1-der dron1 person7 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio1) (free dron1-der) (person-has person7 comida)
   goals met: 3 of 23
15. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 3 of 23
16. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 3 of 23
17. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 3 of 23
18. (move refugio14 refugio8 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio8)
   goals met: 3 of 23
19. (leave box10 refugio8 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio8) (free dron1-der) (person-has person9 comida)
   goals met: 4 of 23
20. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 4 of 23
21. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 4 of 23
22. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 4 of 23
23. (move refugio14 refugio15 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio15)
   goals met: 4 of 23
24. (leave box9 refugio15 dron1-der dron1 person16 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio15) (free dron1-der) (person-has person16 comida)
   goals met: 5 of 23
25. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 5 of 23
26. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 5 of 23
27. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 5 of 23
28. (move refugio14 refugio17 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio17)
   goals met: 5 of 23
29. (leave box8 refugio17 dron1-der dron1 person17 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio17) (free dron1-der) (person-has person17 comida)
   goals met: 6 of 23
30. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 6 of 23
31. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 6 of 23
32. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 6 of 23
33. (leave box7 refugio14 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio14) (free dron1-der) (person-has person2 comida)
   goals met: 7 of 23
34. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 7 of 23
35. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 7 of 23
36. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 7 of 23
37. (leave box22 refugio14 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box22) (box-has box22 medicina)
   added: (at-box box22 refugio14) (free dron1-izq) (person-has person2 medicina)
   goals met: 8 of 23
38. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 8 of 23
39. (pick box21 deposito dron1-izq dron1)
   deleted: (at-box box21 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box21)
   goals met: 8 of 23
40. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 8 of 23
41. (leave box6 refugio6 dron1-der dron1 person3 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio6) (free dron1-der) (person-has person3 comida)
   goals met: 9 of 23
42. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 9 of 23
43. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 9 of 23
44. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 9 of 23
45. (leave box21 refugio6 dron1-izq dron1 person3 medicina)
   deleted: (carrying dron1 dron1-izq box21) (box-has box21 medicina)
   added: (at-box box21 refugio6) (free dron1-izq) (person-has person3 medicina)
   goals met: 10 of 23
46. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 10 of 23
47. (pick box20 deposito dron1-izq dron1)
   deleted: (at-box box20 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box20)
   goals met: 10 of 23
48. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 10 of 23
49. (leave box5 refugio22 dron1-der dron1 person11 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio22) (free dron1-der) (person-has person11 comida)
   goals met: 11 of 23
50. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 11 of 23
51. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 11 of 23
52. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 11 of 23
53. (leave box20 refugio22 dron1-izq dron1 person13 medicina)
   deleted: (carrying dron1 dron1-izq box20) (box-has box20 medicina)
   added: (at-box box20 refugio22) (free dron1-izq) (person-has person13 medicina)
   goals met: 12 of 23
54. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 12 of 23
55. (pick box19 deposito dron1-izq dron1)
   deleted: (at-box box19 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box19)
   goals met: 12 of 23
56. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 12 of 23
57. (leave box19 refugio22 dron1-izq dron1 person19 medicina)
   deleted: (carrying dron1 dron1-izq box19) (box-has box19 medicina)
   added: (at-box box19 refugio22) (free dron1-izq) (person-has person19 medicina)
   goals met: 13 of 23
58. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 13 of 23
59. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 13 of 23
60. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 13 of 23
61. (leave box4 refugio10 dron1-der dron1 person20 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio10) (free dron1-der) (person-has person20 comida)
   goals met: 14 of 23
62. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 14 of 23
63. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 14 of 23
64. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 14 of 23
65. (leave box18 refugio10 dron1-izq dron1 person20 medicina)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 medicina)
   added: (at-box box18 refugio10) (free dron1-izq) (person-has person20 medicina)
   goals met: 15 of 23
66. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 15 of 23
67. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 15 of 23
68. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 15 of 23
69. (leave box3 refugio4 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio4) (free dron1-der) (person-has person8 comida)
   goals met: 16 of 23
70. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 16 of 23
71. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 16 of 23
72. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 16 of 23
73. (leave box17 refugio4 dron1-izq dron1 person8 medicina)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 medicina)
   added: (at-box box17 refugio4) (free dron1-izq) (person-has person8 medicina)
   goals met: 17 of 23
74. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 17 of 23
75. (pick box16 deposito dron1-izq dron1)
   deleted: (at-box box16 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box16)
   goals met: 17 of 23
76. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 17 of 23
77. (leave box16 refugio4 dron1-izq dron1 person15 medicina)
   deleted: (carrying dron1 dron1-izq box16) (box-has box16 medicina)
   added: (at-box box16 refugio4) (free dron1-izq) (person-has person15 medicina)
   goals met: 18 of 23
78. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 18 of 23
79. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 18 of 23
80. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 18 of 23
81. (leave box2 refugio4 dron1-der dron1 person22 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio4) (free dron1-der) (person-has person22 comida)
   goals met: 19 of 23
82. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 19 of 23
83. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 19 of 23
84. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 19 of 23
85. (move refugio4 refugio12 dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 refugio12)
   goals met: 19 of 23
86. (leave box1 refugio12 dron1-der dron1 person18 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio12) (free dron1-der) (person-has person18 comida)
   goals met: 20 of 23
87. (move refugio12 refugio4 dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 refugio4)
   goals met: 20 of 23
88. (leave box15 refugio4 dron1-izq dron1 person22 medicina)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 medicina)
   added: (at-box box15 refugio4) (free dron1-izq) (person-has person22 medicina)
   goals met: 21 of 23
89. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 21 of 23
90. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 21 of 23
91. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 21 of 23
92. (leave box14 refugio12 dron1-der dron1 person18 medicina)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 medicina)
   added: (at-box box14 refugio12) (free dron1-der) (person-has person18 medicina)
   goals met: 22 of 23
93. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 22 of 23
94. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 22 of 23
95. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 22 of 23
96. (leave box13 refugio12 dron1-der dron1 person23 medicina)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 medicina)
   added: (at-box box13 refugio12) (free dron1-der) (person-has person23 medicina)
   goals met: 23 of 23
